""" 2) შექმენით ცვლადი, რომელშიც შეინხავთ input ინსტრუქციით შემოტანილ მნიშვნელობას, შემდეგ შეამოწმებთ თუ რა ტიპის მონაცემი ინახება ამ ცვლადში და დაპრინტავთ. """

num11 =input("enter smt idc --> ")
print(type(num11))


"""  3) თიოთეული მონაცემთა ტიპისთვის (str,int,float), შექმენით 5 ცვლადი და დაუწერეთ კომენტარი თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი  """

num1 = "Stringo"
num2 = int = 12 
num3 = 4343.12
num4 = "8375.321"
num5 = "omguud"

print(type(num1))
print(type(num2))
print(type(num3))
print(type(num4))
print(type(num5))

""" 4) აიღეთ 3 ცვლადი, შეინახეთ განსხავებული მონაცემთა ტიპები (str,int,float), შემდეგ type ინსტრუქციის გამოყენებით შეამოწმეთ, თუ რომელ მონაცემთა ტიპს ინახავს ცვლადი. """

nomero1 = "sssasaassasaas"
nomero2 =  213123213312321
nomero3 = 7756765.76572

print(type(nomero1))
print(type(nomero2))
print(type(nomero3))


"""  5) მომხმარებელს შემოატანინეთ თავისი ასაკი, შემდეგ შემოატანინეთ წლების რაოდენობა. მიღებული ინფორმაცია შეინახეთ ცვლადებში და გამოითვალეთ, რამდენი წლის იქნება მომხმარებელი y (მომხმარებლის მიერ შემოტანილი) წლის შემდეგ. საბოლოოდ გამოუტანეთ შედეგი შემდეგი სახით: "[წლები] წლის შემდეგ თქვენ იქნებით [მომავალი ასაკი] წლის". დავალების შესასრულებლად გამოიყენეთ მონაცემთა ტიპების ხელოვნურად შეცვლის მეთოდები: int() - რომ შეასრულოთ ართიმეტიკული მოქმედებები, str() - რომ დაბეჭდოთ შედეგი შეცდომების გარეშე  """


age = input("enter your age ")
years = input(" enter how many yeasr you wahan grow")
print(age)
print(age + years)
print(years)
print("[you are old 🤣]")

