list = [ "gtx 1080 ti"  "ROG SRIXT RTX 4090 "  "4070 TI SUPER "   "4060 TI " "4070" "3060 " "980 😘 " "5090" "5060 " "5070" "rx 550 "  ]

print(list[3])
list[7] = "gtx 1080 ti" 
print(list[3:2])
print(list[5:1])
print(list[9:6])
print(list[5:7])
print(list[:: - 1])











"""  ```1) შექმენით სია რომელშიც ჩამოწერეთ თქვენთვის სასურველი ელემენტები, მინიმუმ 10```
**indexing**
- გამოიტანეთ სიაში არსებული მესამე ელემენტი
- ჩაანაცვლეთ სიაში არსებული პირველი ელემენტი
**slicing**
- დაბეჭდეთ 2-დან მე-5 ელემენტამდე 
- დაბეჭდეთ მეორე ელემენტიდან ყველა ელემენტი
- დაბეჭდეთ მეხუთე ელემენტამდე ყვეალფერი
- დაბეჭდეთ სია შემობრუნებულად  """