# for ციკლის საშვალებით გამოიტანეთ რიცხვები 20-მდე


for i in range(21):
     print(i)



#  for ციკლის საშვალებით გამოიტანეთ რიცხვები 30-ის ჩათვლით
for i in range(31):
     print(i)


# for ციკლის საშვალებით გამოიტანეთ რიცხვები 15-იდან 80-მდე

for i in range(15, 81):
      print(i)


# for ციკლის საშვალებით გამოიტანეთ რიცხვები 0-იდან 64-ის ჩათვლით

for i in range(0, 65):
    print(i) 



# for ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ჩათვლით


for i in range(51):
    if  i % 3 == 0:
       print(i) 






