#2) მომხმარებელს შემოატანინეთ თავისი სახელი, გვარი, ასაკი და ქალაქი. შემდეგ ეს ინფორმაცია ერთ წინადადებად დაუბეჭდეთ ტერმინალში

#task 1

name=input("enter your name")

surname=input("enter your surname")

hobby=input("enter your hobby")

age=input("enter your name ")

city=input("enter what city you live in")

print(name +" "+     +" "+    hobby  +" "+  surname  +" "+  age +" "+  city)



# შექმენით ცვლადი სახელად celsius სადაც შეინახავთ მთელ რიცხვს. შემდეგ შექმენით ცვლადი სახელად fahrenheit, სადაც უნდა გამოთვალოთ წინა ცვლადის ტემპერატურა რამდენი ფაერენგეიტი იქნება. ასევე შექმენით ცვლადი kelvin რომელშიც შეინახავთ თუ რამდენი კელვინი იქნება celsius ცვლადში მოცემული რიცხვი, საბოლოოდ დაბეჭდეთ სამივე ცვლადი

# task 2

celsius = 64

ferinheit  = 147.2

kelvin = 337.15

print(celsius +" "+ kelvin +" "+ ferinheit )


#ითოეულ მათემატიკურ ოპერატორზე (+, -, *, /, %, **, //) შეასრულეთ 5 მაგალითი და დაბეჭდეთ შედეგი

# task 3

print(5+5)
print(4+4)
print(87+32)
print(89423432+312321)
print(999+999)
print(89-8)
print(43-42)
print(98-64)
print(866-54)
print(32-31)
print(34*5)
print(585*6)
print(78*7)
print(32*21)
print(321*31)
print(321/312)
print(43/4)
print(34/43)
print(44/32)
print(656/5543)
print(4343/4343)
print(34/66)
print(34%43)
print(8787%43)
print(321%43)
print(564%21)
print(343%43)
print(4314**43434)
print(43214**4355)
print(76754**958767)
print(89**909)
print(34*32)
print(34//43)
print(321/64)
print(3432//543)
print(3454//4354)
print(3412//454)



#6) კომეტარებით ახსენით თუ რა განსხვავებაა /, //, და % მათემატიკურ ოპერატორებს შორის, დაწერეთ რას აკეთებს თითოეული

# 1 % (მოდულის (ან მოდულო) ოპერაცია არის ფუნდამენტური არითმეტიკული ოპერაცია, რომელიც ითვლის დანარჩენს ერთი რიცხვის ერთმანეთზე გაყოფის   პროგრამირების ენებზე)

# 2 // (იატაკის გაყოფა არის დაყოფის ტიპი, რომელშიც შედეგი არის ყველაზე დიდი მთელი რიცხვი, რომელიც კოეფიციენტზე  // ოპერატორი იატაკის განყოფილების შესასრულებლად.)

# 3 / (პითონში / ოპერატორი გამოიყენება სტანდარტული გაყოფისთვის, )


