
# გააკეთეთ 5-5 მაგალითი თთოეულ შედარების ოპერატორზე (>, >=, <, <=, ==, !=), გვერდზე კომენტარის საშვალებით მიუთითეთ თუ რომელ boolean მნიშვნელობას გამოიტანას, აიღეთ მრავალფეროვანი კომბინაციები, შეეცადეთ გქონდეთ ყველა ვარიანტი

# task 1

MAIN_NUMBER = 5-5

# true

print(5 > 4)
print(5 < 10)
print(5 >= 1)
print(5 <= 23)
print(5 == 5)
print(5 != 4)



# false


print(5 > 12)
print(5 < 4)
print(5 >= 123)
print(5 <= 1)
print(5 == 2)
print(5 != 213)


# task 2 


# ექმენით 5 ცვლადი, რომლებშიც შეინახავთ განსხვავებულ შედარების ოპერაციათა შედეგებს, შედარების ოპერაციას გვერდზე კომენტარის საშვალებით მიუწერეთ მისი შედეგი (boolean მნიშვნელობა) და ახსენით რა განსხვავებაა ოპერატორსა და ოპერაციას შორის


num1 = 12 > 23 # true
num2 = 342 >= 23321 # false
num3 = 321 < 233211 # true
num4 = 12 == 23 # false
num5 = 12 <= 23 # false

print(num5)
print(num4)
print(num3)
print(num2)
print(num1)





# შექმენით 5 ცვლადი, რომლებშიც შეინახავთ განსხვავებულ ლოგიკურ და შედარების ოპერაციათა შედეგებს (უნდა იყოს შედარების და ლოგიკური ოპერატორები ერთად მაგალითად temperature > 30 and not cloudy), გვერდზე კომენტარის საშვალებით მიუწერეთ ეს შედეგი (boolean მნიშვნელობა) აიღეთ მრავალფეროვანი კომბინაციები


